# DerivedAnalyticalModelDisabled Property (2022)

---
C#Visual BasicVisual C++
Revit 2022 API
---
BuiltInFailures..::..AnalyticalModelFailures..::..DerivedAnalyticalModelDisabled Property
BuiltInFailures..::..AnalyticalModelFailures Class See Also
---
Derived Analytical Model was disabled. File was open in Contextual Analytical Model mode.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId DerivedAnalyticalModelDisabled { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property DerivedAnalyticalModelDisabled As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ DerivedAnalyticalModelDisabled {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..AnalyticalModelFailures Class
Autodesk.Revit.DB Namespace